# Microsoft_Sentinel_SIEM

This project showcases the successful deployment of Microsoft Sentinel, a powerful SIEM solution, in the Azure Cloud environment. Leveraging custom analytics rules using KQL, it enhances security event detection and enables thorough incident investigations. The project covers aspects like user entity behavior analysis, watchlist creation, and scheduled rule configuration. Explore the implementation workflow for a comprehensive understanding of Azure Sentinel's capabilities

Prerequisites
Before starting with this project, make sure you have the following:

Azure Account:
Create or use an existing Azure Cloud account.

Microsoft Sentinel:
Obtain the necessary licenses for Microsoft Sentinel.

Azure Sentinel Workspace:
Set up an Azure Sentinel workspace following the official documentation.

Access Permissions:
Ensure your Azure account has the required permissions for resource deployment.


Configuration Snapshots:

1. Custom Deployment
Execute a customized deployment of Microsoft Sentinel within the Azure Cloud environment.
Github Repository for Deployment: (https://github.com/Azure/Azure-Sentinel/tree/master/Tools/Sentinel-All-In-One)
[Imgur](https://i.imgur.com/my8ctDy.png)


2.Diagnostic Settings
Configure diagnostic settings to capture relevant data for analysis within Azure Sentinel.
[Imgur](https:/i./imgur.com/CG6xIQd.png)

Sentinel DashBoard or Overview
Showcases the overview of Microsoft Sentinel, illustrating a holistic view of security data.
[Imgur](https://i.imgur.com/JWpXKcW.png)

Sentinel Logs
Highlight the logs section in Azure Sentinel, emphasizing the recorded security events.
[Imgur](https://imgur.com/tJcSgEz)


Entity Behaviour Configuration
Setting up configurations for monitoring and analyzing user entity behavior within the environment.
[Imgur](https://imgur.com/yAa35hc)

Watchlist creation
Create and configure watchlists for tracking specific entities.
[Imgur](https://imgur.com/5g0Pgqq)


Analytics Rule
Implement custom analytics rules using KQL to enhance security event detection.
Query:
let TorNodes = (_GetWatchlist('Tor-ip-addresses') | project TorIP = IpAddress);
 SigninLogs
 | where IPAddress in (TorNodes)
 | where ResultType != 50126
 | project
    TimeGenerated,
    Location,
    IPAddress,
    UserDisplayName,
    UserPrincipalName,
    UserId,
    LocationDetails,
    RiskState,
    RiskLevelDuringSignIn,
    AuthenticationRequirement,
    ClientAppUsed,
    ConditionalAccessPolicies
[Imgur](https://imgur.com/6agcuGf)
[Imgur](https://imgur.com/xEjUhgO)

Creating New User
Create a new user account within the Azure environment.
[Imgur](https://imgur.com/tLKUvh7)

Assigning role to new user
Assign roles to a newly created user account.
[Imgur](https://imgur.com/AlgOglV)

New user login
Log into the new user settings to simulate user activity for analysis.
[Imgur](https://imgur.com/5lHhmus)

Delete Diagnosic Setting
Delete diagnostic settings for user.
[Imgur](https://imgur.com/dRAlQAl)

Creating VM
Creating a virtual machine in the Azure environment.
[Imgur](https://imgur.com/n6v7cJJ)

Default user sentinel overview
Display the default user's view of the Sentinel overview for a comprehensive understanding.
[Imgur](https://imgur.com/5kqDpAA)

Captured Incidents
View and analyze incidents captured by Azure Sentinel during the investigation.
[Imgur](https://imgur.com/baLriCO)

Investigating Incident
Use SIEM tools and techniques to investigate and analyze captured incidents.
[Imgur](https://imgur.com/mfJuygg)

Logs
Display logs generated by Azure Sentinel during the monitoring and investigation process.
[Imgur](https://imgur.com/HHimdjo)

Closing Incidents
Take actions and close incidents based on the investigation findings.
[Imgur](https://imgur.com/aYmaDBs)

AbuseIPDB
[Imgur](https://imgur.com/AnQSAeT)










